Documents/ЗапросДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗапросДокументов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМессенджеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОтправкиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЗадолженностьПоОбъектамОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗадолженностьПоОбъектамОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаДО</Name>
					<Comment>Сумма задолженности в валюте долгового обязательства</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма задолженности в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыДокументовПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыДокументовПоДоговору</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГарантийноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СправкаОбОтсутствииЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеТребование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеТребованиеЦессия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ГарантийноеПисьмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ГарантийноеПисьмо</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цедент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЦессии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорЦессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолгПоТелу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолгПоПроцентам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПениШтрафы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейПросрочкиОбщее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СправкаОбОтсутствииЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СправкаОбОтсутствииЗадолженности</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цедент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЦессии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорЦессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗапросДокументов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	// Получим непредопределенное значение с сервера
	ЭтаФорма.Авторизованный = ПользователиКлиентСервер.АвторизованныйПользователь();
	ЭтаФорма.РКЦ = Справочники.Пользователи.НайтиПоНаименованию("Дорохина Алена Юрьевна");
	ЭтаФорма.ЗРКЦ = Справочники.Пользователи.НайтиПоНаименованию("Арабова Римма Эйнуллавна");
	ЭтаФорма.АБД = Справочники.Пользователи.НайтиПоНаименованию("Попов Николай Алексеевич");
	ЭтаФорма.ГарантийноеПисьмо = Перечисления.ТипыДокументовПоДоговору.ГарантийноеПисьмо;
	ЭтаФорма.СправкаОбОтсутствииЗадолженности = Перечисления.ТипыДокументовПоДоговору.СправкаОбОтсутствииЗадолженности;
	// Получим остатки из регистра сведений
	НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ЭтаФорма.Объект.Договор);
	НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Основной долг"));
	НаборЗаписей.Прочитать(); 
	Для каждого ЗаписьНабора из НаборЗаписей Цикл
		ЭтаФорма.ДолгПоТелу = ЗаписьНабора.СуммаДО;
	КонецЦикла;
	НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ЭтаФорма.Объект.Договор);
	НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Проценты"));
	НаборЗаписей.Прочитать(); 
	Для каждого ЗаписьНабора из НаборЗаписей Цикл
		ЭтаФорма.ДолгПоПроцентам = ЗаписьНабора.СуммаДО;
	КонецЦикла;
	НаборЗаписей = РегистрыСведений.ЗадолженностьПоОбъектамОстатки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ЭтаФорма.Объект.Договор);
	НаборЗаписей.Отбор.ТипЗадолженности.Установить(ПланыВидовХарактеристик.ТипыЗадолженности.НайтиПоНаименованию("Пени"));
	НаборЗаписей.Прочитать(); 
	Для каждого ЗаписьНабора из НаборЗаписей Цикл
		ЭтаФорма.ПениШтрафы = ЗаписьНабора.СуммаДО;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Получим непредопредленное значение с сервера
	ПриОткрытииНаСервере();
	Если ЭтаФорма.Авторизованный = ЭтаФорма.РКЦ
		ИЛИ ЭтаФорма.Авторизованный = ЭтаФорма.ЗРКЦ
		ИЛИ	ЭтаФорма.Авторизованный = ЭтаФорма.АБД Тогда
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьДокумент.Видимость = Истина;
	Иначе
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьДокумент.Видимость = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Автор) = Ложь Тогда
		ЭтаФорма.Объект.Автор = ЭтаФорма.Авторизованный;
	КонецЕсли;
КонецПроцедуры

// Для тонкого клиента
&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитаНаСервере(ИмяОбъекта, ИмяРеквизита)
Возврат ИмяОбъекта[ИмяРеквизита];
КонецФункции
//

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	// Заполнить документ
	Если ЭтаФорма.Объект.ТипДокумента = ЭтаФорма.ГарантийноеПисьмо Тогда
		ФормаДок = ПолучитьФорму("Документ.ГарантийноеПисьмо.Форма.ФормаДокумента");
		ФормаДок.Объект.Договор = ЭтаФорма.Объект.Договор;
		ФормаДок.Объект.Должник = ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Объект.Договор, "Должник");
		ФормаДок.Объект.Цедент = ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Объект.Договор, "Кредитор");
		ФормаДок.Объект.ДатаЦессии = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0158");
		ФормаДок.Объект.ДоговорЦессии = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0157");
		ФормаДок.Объект.ДатаВыдачи = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0161");
		ФормаДок.Объект.ДолгПоТелу = ЭтаФорма.ДолгПоТелу;
		ФормаДок.Объект.ДолгПоПроцентам = ЭтаФорма.ДолгПоПроцентам;
		ФормаДок.Объект.ПениШтрафы = ЭтаФорма.ПениШтрафы;
		ФормаДок.Объект.Сумма = ФормаДок.Объект.ДолгПоТелу + ФормаДок.Объект.ДолгПоПроцентам + ФормаДок.Объект.ПениШтрафы;
		ФормаДок.Объект.ДатаРождения = ОбъектыСервер.ПолучитьЗначениеСвойства(ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Объект.Договор, "Должник"), "0043");
		ФормаДок.Объект.ДнейПросрочки = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0139");
		ФормаДок.Объект.ДнейПросрочкиОбщее = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0141");
		ЭтаФорма.Закрыть();
		ФормаДок.Открыть();
	ИначеЕсли ЭтаФорма.Объект.ТипДокумента = ЭтаФорма.СправкаОбОтсутствииЗадолженности Тогда
		ФормаДок = ПолучитьФорму("Документ.СправкаОбОтсутствииЗадолженности.Форма.ФормаДокумента");
		ФормаДок.Объект.Договор = ЭтаФорма.Объект.Договор;
		ФормаДок.Объект.Должник = ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Объект.Договор, "Должник");
		ФормаДок.Объект.Цедент = ПолучитьЗначениеРеквизитаНаСервере(ЭтаФорма.Объект.Договор, "Кредитор");
		ДО = ЭтаФорма.Объект.Договор;
		ФормаДок.Объект.ДатаЦессии = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0158");
		ФормаДок.Объект.ДоговорЦессии = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0157");
		ФормаДок.Объект.ДатаВыдачи = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтаФорма.Объект.Договор, "0161");
		ЭтаФорма.Закрыть();
		ФормаДок.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.ТипДокумента) = Ложь Тогда
		Предупреждение("Не задано состояние документа!",,"Ошибка проведения документа");
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Объект.Получатель) = Ложь Тогда
		Предупреждение("Не задан получатель!",,"Ошибка проведения документа");
		Отказ = Истина;
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Объект.Состояние) = Ложь Тогда
		Предупреждение("Не задано состояние!",,"Ошибка проведения документа");
		Отказ = Истина;
	ИначеЕсли ЭтаФорма.Объект.Проведен = Ложь Тогда
		Предупреждение("Документ не проведен!",,"Ошибка сохранения документа");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
